{
  "p-s930": {
    "imglink": "https://rotocastgroup.com/wp-content/uploads/2024/01/S-930-04.jpg",
    "title": "Steel Short, Size S-930",
    "description": "Steel shot size S-930 is a high-quality abrasive media widely utilized in various industrial applications, particularly in the field of surface preparation and shot peening. With a nominal diameter of 0.93 millimeters, S-930 steel shots are designed to provide an optimal balance between durability and efficiency. This specific size is often preferred for applications where a fine, controlled surface finish is crucial. The S-930 steel shots exhibit superior hardness, ensuring prolonged life and consistent performance during abrasive blasting processes. Industries such as automotive, aerospace, and metal fabrication rely on S-930 steel shots to achieve precise and uniform surface treatments, ultimately enhancing the durability and performance of the treated materials. The stringent manufacturing standards associated with S-930 guarantee reliability and adherence to industry specifications, making it a preferred choice for professionals seeking consistent and effective abrasive media for their surface preparation needs.",
    "ChemicalComposition": "Carbon 0.85-1.20%, Silicon 0.45-1.50%, Manganese 0.35-1.20%, Phosphorus <0.05% Sulphur <0.05%",
    "Hardness": "40-50 HRc. (Rockwell C), Custom hardness on request",
    "Microstructure": "Uniform martensite, tempered to a degree consistent with the hardness range, with fine, well distributed carbides, if any."
  },
  "p-s780": {
    "imglink": "https://rotocastgroup.com/wp-content/uploads/2024/01/S-780.jpg",
    "title": "Steel Short, Size S-780",
    "description": "Steel shot size S-780 refers to a specific classification within the range of steel shots used in various industrial applications, particularly in abrasive blasting processes. The S in S-780 denotes that it conforms to the SAE J827 specification, indicating a spherical shape. The number 780 corresponds to the average diameter of the steel shots in hundredths of an inch, specifically 0.078 inches or 2.0 millimeters. S-780 steel shots are characterized by their robustness and durability, making them suitable for demanding tasks such as surface preparation, cleaning, and shot peening in industries like shipbuilding, automotive, and metal fabrication. The size S-780 is often chosen for its ability to deliver effective and consistent results in removing rust, scale, and contaminants from various surfaces while contributing to achieving the desired surface finish.",
    "ChemicalComposition": "Carbon 0.85-1.20%, Silicon 0.45-1.50%, Manganese 0.35-1.20%, Phosphorus <0.05%, Sulphur <0.05%",
    "Hardness": "40-50 HRc. (Rockwell C), Custom hardness on request",
    "Microstructure": "Uniform martensite, tempered to a degree consistent with the hardness range, with fine, well distributed carbides, if any."
  },
  "p-s660": {
    "imglink": "https://rotocastgroup.com/wp-content/uploads/2024/01/S-660-01.jpg",
    "title": "Steel Short, Size S-660",
    "description": "Steel shot size S-660 refers to a specific classification of steel shots used in abrasive blasting applications. The S in S-660 stands for steel, and the number 660 represents the average diameter of the individual steel shots in micrometers. In this context, S-660 is relatively large, indicating a robust and coarse abrasive particle size. This size is often employed in applications where a more aggressive and efficient abrasive action is required, such as in the removal of tough coatings or preparing surfaces for coating applications. The use of S-660 steel shots helps achieve desired surface profiles and cleanliness, making it a suitable choice for demanding industrial processes that require high-performance abrasive blasting.",
    "ChemicalComposition": "Carbon 0.85-1.20%, Silicon 0.45-1.50%, Manganese 0.35-1.20%, Phosphorus <0.05%, Sulphur <0.05%",
    "Hardness": "40-50 HRc. (Rockwell C), Custom hardness on request",
    "Microstructure": "Uniform martensite, tempered to a degree consistent with the hardness range, with fine, well distributed carbides, if any."
  },
  "p-s460": {
    "imglink": "https://rotocastgroup.com/wp-content/uploads/2024/01/S-460-06.jpg",
    "title": "Steel Short, Size S-460",
    "description": "Steel shot size S-460 refers to a specific grade of abrasive material commonly used in industrial processes such as shot blasting and peening. The S designation indicates that it is a spherical shot, while the number 460 corresponds to the approximate diameter of the individual steel particles in micrometers. In the case of S-460, the average diameter falls within the range of 0.4 to 0.6 millimeters. This particular size is chosen based on the desired surface finish and intensity of the treatment. S-460 steel shots are known for their durability, high impact energy, and effective removal of rust, scale, and contaminants from metal surfaces. The uniformity in size ensures consistent results, making S-460 a popular choice in applications where precision and reliability are paramount.",
    "ChemicalComposition": "Carbon 0.85-1.20%, Silicon 0.45-1.50%, Manganese 0.35-1.20%, Phosphorus <0.05%, Sulphur <0.05%",
    "Hardness": "40-50 HRc. (Rockwell C), Custom hardness on request",
    "Microstructure": "Uniform martensite, tempered to a degree consistent with the hardness range, with fine, well distributed carbides, if any."
  },
  "p-s390": {
    "imglink": "https://rotocastgroup.com/wp-content/uploads/2024/01/S-390-01.jpg",
    "title": "Steel Short, Size S-390",
    "description": "Steel shot size S-390 refers to a specific grade of abrasive particles used in industrial applications such as shot blasting and surface preparation. The S in S-390 denotes that it is a steel shot, while the number 390 indicates its nominal diameter in micrometers. In the case of S-390, the average diameter of the steel shot particles is around 0.390 millimeters. This size is chosen based on the desired impact energy and coverage for the particular application. S-390 steel shots are known for their durability, high impact resistance, and ability to efficiently remove contaminants, rust, and scale from various surfaces. These qualities make S-390 a popular choice in industries where consistent and effective surface treatment is crucial, such as in metal fabrication, automotive, and shipbuilding.",
    "ChemicalComposition": "Carbon 0.85-1.20%, Silicon 0.45-1.50%, Manganese 0.35-1.20%, Phosphorus <0.05% Sulphur <0.05%",
    "Hardness": "40-50 HRc. (Rockwell C), Custom hardness on request",
    "Microstructure": "Uniform martensite, tempered to a degree consistent with the hardness range, with fine, well distributed carbides, if any."
  },
  "p-s280": {
    "imglink": "https://rotocastgroup.com/wp-content/uploads/2024/01/S-280-05.jpg",
    "title": "Steel Short, Size S-280",
    "description": "Steel shot size S-280 refers to a specific classification of abrasive particles used in shot blasting applications. In the context of steel shots, the designation S-280 indicates the size of the individual particles. The S stands for steel, and the number 280 denotes the nominal diameter of the shot in hundredths of an inch. Therefore, S-280 steel shots have a nominal diameter of approximately 0.028 inches. These shots are commonly employed in industrial processes such as shot peening and abrasive blasting, where they play a crucial role in surface preparation, cleaning, and strengthening of materials. The S-280 size is selected based on the desired impact energy and surface coverage, making it suitable for applications requiring efficient and uniform abrasion for tasks like removing rust, scale, or old coatings from various surfaces.",
    "ChemicalComposition": "Carbon 0.85-1.20%, Silicon 0.45-1.50%, Manganese 0.35-1.20%, Phosphorus <0.05% Sulphur <0.05%",
    "Hardness": "40-50 HRc. (Rockwell C), Custom hardness on request",
    "Microstructure": "Uniform martensite, tempered to a degree consistent with the hardness range, with fine, well distributed carbides, if any."
  },
  "p-s230": {
    "imglink": "https://rotocastgroup.com/wp-content/uploads/2024/01/S-230-01.jpg",
    "title": "Steel Short, Size S-230",
    "description": "Steel shot size S-230 refers to a specific classification within the abrasive blasting industry, indicating the particle size of the steel shots used for surface cleaning and preparation. In this context, S-230 denotes a nominal diameter range between 0.6 and 0.7 millimeters. These steel shots are commonly employed in various applications, such as cleaning, peening, and descaling surfaces like metal, concrete, or other materials. The S-230 size is chosen based on its ability to provide effective and efficient results in removing rust, scale, and other contaminants from surfaces, leaving behind a clean and properly prepared substrate. The use of steel shots in abrasive blasting processes is integral to achieving desired surface finishes and enhancing the adhesion of coatings or paints. The S-230 size, with its specific particle dimensions, ensures a balance between material removal efficiency and surface texture, making it a versatile choice in industrial cleaning and surface treatment applications.",
    "ChemicalComposition": "Carbon 0.85-1.20%, Silicon 0.45-1.50%, Manganese 0.35-1.20%, Phosphorus <0.05% Sulphur <0.05%",
    "Hardness": "40-50 HRc. (Rockwell C), Custom hardness on request",
    "Microstructure": "Uniform martensite, tempered to a degree consistent with the hardness range, with fine, well distributed carbides, if any."
  },
  "p-s170": {
    "imglink": "https://rotocastgroup.com/wp-content/uploads/2024/01/S-170-01.jpg",
    "title": "Steel Short, Size S-170",
    "description": "Steel shot size S-170 refers to a specific classification within the range of steel shots used in various industrial applications. The S denotes its spherical shape, and the number 170 indicates its nominal diameter in mesh size. In this case, S-170 has an approximate diameter of 0.0058 inches or 0.1473 millimeters. This particular size is commonly employed in abrasive blasting processes, such as shot peening and surface preparation, where the goal is to clean, strengthen, or modify the surface of materials like metal, concrete, or composites. S-170 steel shots are known for their durability and hardness, making them effective for removing rust, scale, and contaminants from surfaces, while also imparting a desirable texture or finish. The selection of steel shot size is crucial in achieving specific surface treatment results, and S-170 finds its niche in applications requiring precision and consistent performance.",
    "ChemicalComposition": "Carbon 0.85-1.20%, Silicon 0.45-1.50%, Manganese 0.35-1.20%, Phosphorus <0.05% Sulphur <0.05%",
    "Hardness": "40-50 HRc. (Rockwell C), Custom hardness on request",
    "Microstructure": "Uniform martensite, tempered to a degree consistent with the hardness range, with fine, well distributed carbides, if any."
  },
  "p-s110": {
    "imglink": "https://rotocastgroup.com/wp-content/uploads/2024/01/S-110-03.jpg",
    "title": "Steel Short, Size S-110",
    "description": "Steel shots with a size designation of S-110 refer to a specific grade and particle size within the abrasive blasting industry. The S stands for steel, indicating the material composition, while the number 110 denotes the sieve mesh size. In this context, S-110 steel shots have a particle size distribution that corresponds to the 110 mesh size, indicating a finer and more uniform grain structure. This particular size is often utilized for applications where a smoother surface finish is desired, such as in industries like automotive manufacturing or aerospace. The S-110 steel shots are known for their efficiency in removing rust, scale, and other contaminants from surfaces, making them a popular choice for shot blasting operations aiming for precision and quality surface preparation. The controlled size and hardness of S-110 steel shots contribute to their effectiveness in achieving consistent results while minimizing abrasive wear and prolonging equipment life.",
    "ChemicalComposition": "Carbon 0.85-1.20%, Silicon 0.45-1.50%, Manganese 0.35-1.20%, Phosphorus <0.05% Sulphur <0.05%",
    "Hardness": "40-50 HRc. (Rockwell C), Custom hardness on request",
    "Microstructure ": "Uniform martensite, tempered to a degree consistent with the hardness range, with fine, well distributed carbides, if any."
  },
  "p-s70": {
    "imglink": "https://rotocastgroup.com/wp-content/uploads/2024/01/S-70-03.jpg",
    "title": "Steel Short, Size S-70",
    "description": "Steel shot size S-930 is a high-quality abrasive media widely utilized in various industrial applications, particularly in the field of surface preparation and shot peening. With a nominal diameter of 0.93 millimeters, S-930 steel shots are designed to provide an optimal balance between durability and efficiency. This specific size is often preferred for applications where a fine, controlled surface finish is crucial. The S-930 steel shots exhibit superior hardness, ensuring prolonged life and consistent performance during abrasive blasting processes. Industries such as automotive, aerospace, and metal fabrication rely on S-930 steel shots to achieve precise and uniform surface treatments, ultimately enhancing the durability and performance of the treated materials. The stringent manufacturing standards associated with S-930 guarantee reliability and adherence to industry specifications, making it a preferred choice for professionals seeking consistent and effective abrasive media for their surface preparation needs.",
    "ChemicalComposition": "Carbon 0.85-1.20%, Silicon 0.45-1.50%, Manganese 0.35-1.20%, Phosphorus <0.05% Sulphur <0.05%",
    "Hardness": "40-50 HRc. (Rockwell C), Custom hardness on request",
    "Microstructure ": "Uniform martensite, tempered to a degree consistent with the hardness range, with fine, well distributed carbides, if any."
  },
  "p-s330": {
    "imglink": "https://rotocastgroup.com/wp-content/uploads/2024/01/S-330-04.jpg",
    "title": "Steel Short, Size S-330",
    "description": "Steel shot size S-330 refers to a specific classification within the range of steel shots used for abrasive blasting processes. The “S” designation indicates that the shots are spherical in shape, while the number “330” denotes the approximate diameter of the individual steel particles in mesh size. In the case of S-330, the particles have a diameter of around 0.0394 inches (1.0 mm). This particular size is commonly employed for heavy-duty applications in abrasive blasting, where a robust and efficient removal of rust, scale, or other surface contaminants is essential. The S-330 steel shots exhibit high impact energy, ensuring effective surface preparation in industries such as shipbuilding, construction, and metal fabrication. The uniformity and hardness of S-330 steel shots contribute to their durability and reusability, making them a reliable choice for demanding blasting operations.",
    "ChemicalComposition": "Carbon 0.85-1.20%, Silicon 0.45-1.50%, Manganese 0.35-1.20%, Phosphorus <0.05% Sulphur <0.05%",
    "Hardness": "40-50 HRc. (Rockwell C) Custom hardness on request",
    "Microstructure ": "Uniform martensite, tempered to a degree consistent with the hardness range, with fine, well distributed carbides, if any."
  }
}